handouts/lecture_notes/finalreview/finalreview_2017.org
#+TITLE: Review of Econometrics
#+DATE: June 5th, 2017
#+OPTIONS: toc:nil H:3 num:2
#+PROPERTY: header-args:R  :session my-r-session
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=1.0in]{geometry}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \onehalfspacing
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \hypersetup{colorlinks,citecolor=black,filecolor=black,linkcolor=black,urlcolor=black}
#+LATEX_HEADER: \newtheorem{mydef}{Definition}
#+LATEX_HEADER: \newtheorem{mythm}{Theorem}
#+LATEX_HEADER: \newcommand{\dx}{\mathrm{d}}
#+LATEX_HEADER: \newcommand{\var}{\mathrm{Var}}
#+LATEX_HEADER: \newcommand{\cov}{\mathrm{Cov}}
#+LATEX_HEADER: \newcommand{\corr}{\mathrm{Corr}}
#+LATEX_HEADER: \newcommand{\pr}{\mathrm{Pr}}
#+LATEX_HEADER: \newcommand{\rarrowd}[1]{\xrightarrow{\text{ \textit #1 }}}
#+LATEX_HEADER: \DeclareMathOperator*{\plim}{plim}
#+LATEX_HEADER: \newcommand{\plimn}{\plim_{n \rightarrow \infty}}

* The Essence of the OLS Estimation
Multiple regression model involves the models as follows
\begin{equation}
\label{eq:multi-regress-1}
Y_i = \beta_0 + \beta_1 X_{1i} + \beta_2 X_{2i} + \cdots + \beta_k X_{ki} + u_i,\; i = 1, \ldots, n
\end{equation}

Or in matrix notation
\begin{equation}
\label{eq:multi-regress-m}
\mathbf{Y} = \mathbf{X} \boldsymbol{\beta} + \mathbf{u}
\end{equation}

** The OLS estimation

The OLS estimator is the solution to the minimization problem that
minimizes the sum of squared prediction mistakes (residuals)
\begin{equation}
\label{eq:ols-multi-regress}
\operatorname*{Minimize}_{b_i,i=0,\dotsc,k}\: \sum_{i=1}^n \hat{u}_i^2 = \sum_{i=1}^n (Y_i - b_0 - b_1 X_{1i} - \cdots - b_k X_{ki})^2
\end{equation}

*** When $k = 2$
\begin{align}
\hat{\beta}_1 & = \frac{\sum_{i=1}^n (X_i - \bar{X})(Y_i - \bar{Y})}{\sum_{i=1}^n (X_i - \bar{X})^2}  \label{eq:betahat-1} \\
\hat{\beta}_0 & = \bar{Y} - \hat{\beta}_1 \bar{X}  \label{eq:betahat-0}
\end{align}

*** In general
\begin{equation}
\label{eq:betahat-mult}
\boldsymbol{\hat{\beta}} = (\mathbf{X}^{\prime} \mathbf{X})^{-1} \mathbf{X}^{\prime} \mathbf{Y}
\end{equation}

** Measures of fit
*** SER
\begin{equation}
\label{eq:ser-m}
SER = s_{\hat{u}},\; \text{ where } s^2_{\hat{u}} = \frac{1}{n-k-1} \sum_{i=1}^n \hat{u}_i^2 =\frac{\mathbf{\hat{u}}^{\prime} \mathbf{\hat{u}}}{n-k-1} = \frac{SSR}{n-k-1}
\end{equation}
*** $R^2$
- The total sum of squares (TSS): $TSS = \sum_{i=1}^n (Y_i - \bar{Y})^2$
- The explained sum of squares (ESS): $ESS = \sum_{i=1}^n (\hat{Y}_i - \bar{Y})^2$
- The sum of squared residuals (SSR): $SSR = \sum_{i=1}^n
     \hat{u}_i^2$
- An important equality is $TSS = ESS + SSR$, which holds only when we
  use the OLS estimation. 

\begin{equation}
\label{eq:r2-center} 
R^2 = \frac{ESS}{TSS} = 1 - \frac{SSR}{TSS}
\end{equation}

*** The Adjusted $R^2$
\begin{equation}
\label{eq:adj-r2}
\bar{R}^2 = 1 - \frac{n-1}{n-k-1}\frac{SSR}{TSS} = 1 - \frac{s^2_u}{s^2_Y}
\end{equation}

- What is the purpose of designing the adjusted $R^2$?

  It is to alleviate the problem of $R^2$ that when a new regressor is
  added, as long as its coefficient is not zero, $R^2$ will always
  increase, regardless of whether the new regressor is a determinant
  of $Y$. 

*** The limitation of $R^2$ and $\bar{R}^2$
- A high $R^2$ or $\bar{R}^2$ does not mean that you have eliminated omitted variable bias.
- A high $R^2$ or $\bar{R}^2$ does not mean that you have an unbiased estimator of a causal effect ($\beta_1$).
- A high $R^2$ or $\bar{R}^2$ does not mean that the included
  variables are statistically significant. This must be determined
  using hypotheses tests.

** The least squares assumptions
- Assumption #1: $E(u_i | \mathbf{X}_i) = 0$
- Assumption #2: $(Y_i, \mathbf{X}_i^{\prime})\, i=1, \ldots, n$ are i.i.d.
- Assumption #3: Large outliers are unlikely, i.e.,, $0 < E(\mathbf{X}^4) < \infty$ and $0 < E(\mathbf{Y}^4) < \infty$
- Assumption #4: No perfect multicollinearity
** Sampling distributions of the OLS estimators
*** Unbiasedness:
$E(\hat{\boldsymbol{\beta}}) = \boldsymbol{\beta}$
*** Consistency: 
$\plim_{n \rightarrow \infty} \hat{\boldsymbol{\beta}} = \boldsymbol{\beta}$
*** Efficiency: 
The Gauss-Markov theorem ensures that the OLS is the BLUE under the least
squares assumptions plus the homoskedasticity assumption. 
*** The asymptotic normal distribution: 
\begin{equation}
\label{eq:normal-bhat-m}
\hat{\boldsymbol{\beta}} \rarrowd{d} N(\boldsymbol{\beta}, \mathbf{\Sigma_{\hat{\boldsymbol{\beta}}}})
\end{equation}
where $\mathbf{\Sigma_{\hat{\boldsymbol{\beta}}}} =
\var(\hat{\boldsymbol{\beta}} | \mathbf{X})$ for which use
Equation (\ref{eq:varbhat-hm}) for the homoskedastic case and Equation
(\ref{eq:varbhat-ht}) for the heteroskedastic case. 
\begin{align}
\var(\hat{\boldsymbol{\beta}} | \mathbf{X}) &= \sigma^2_u (\mathbf{X}^{\prime} \mathbf{X})^{-1} \label{eq:varbhat-hm} \\
\var_{\mathrm{h}}(\hat{\boldsymbol{\beta}} | \mathbf{X}) &= \left(\mathbf{X}^{\prime} \mathbf{X}\right)^{-1} \mathbf{\Sigma} (\mathbf{X}^{\prime} \mathbf{X})^{-1} \label{eq:varbhat-ht}
\end{align} 

* Hypothesis Test Concerning the Coefficients in Multiple Regression Models
** The t test
*** A single hypothesis test
- Two sided: \[ H_0:\, \beta_j = \beta_{j,0} \text{ vs. } H_1:\, \beta_j \neq
  \beta_{j,0} \] 
- One sided: \[ H_0:\, \beta_j = \beta_{j,0} \text{ vs. } H_1:\, \beta_j <
  \beta_{j,0} \]
*** The t statistics
\[ t = \frac{\hat{\beta}_j - \beta_{j,0}}{SE(\hat{\beta}_j)} \]
where $SE(\hat{\beta}_j)$ is the *heteroskedasticity-robust* standard error of $\hat{\beta}_j$. 

*** The confidence interval
\[ \left[\hat{\beta}_j - 1.96 SE(\hat{\beta}_j),\; \hat{\beta}_j +
1.96 SE(\hat{\beta}_j)\right] \]

** The F test
*** A joint hypothesis: linear and involving more than one coefficients
\begin{equation}
\label{eq:jnt-hypo-1}
H_0: \beta_1 = \beta_{1,0},\ \ldots, \beta_q = \beta_{q,0} \text{ vs. } H_1: \text{at least one restriction does not hold}
\end{equation} 
\begin{equation}
\label{eq:jnt-hyp-2}
H_0:\, \beta_1 = \beta_2 \text{ vs. } H_1:\, \beta_1 \neq \beta_2
\end{equation}
or
\begin{equation}
\label{eq:jnt-hyp-3}
H_0:\, \beta_1 + \beta_2 = 1 \text{ vs. } H_1:\, \beta_1 + \beta_2 \neq 1
\end{equation}
or more generally, 
\begin{equation}
\label{eq:jnt-hyp-4}
H_0: \beta_1 + \beta_2 = 0,\, 2\beta_2 + 4\beta_3 + \beta_4 = 3 \text{ vs. } H_1:\, \text{at least one restriction does not hold}
\end{equation}
\begin{equation}
\label{eq:jnt-hyp-g}
H_0:\, \mathbf{R}\boldsymbol{\beta} = \mathbf{r} \text{ vs. } H_1: \mathbf{R}\boldsymbol{\beta} \neq \mathbf{r}
\end{equation}

