handouts/lecture_notes/finalreview/finalreview_2017.tex
% Created 2017-06-04 Sun 14:39
% -*- latex-run-command: pdflatex -*-
\documentclass[a4paper,10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1.0in]{geometry}
\usepackage{setspace}
\onehalfspacing
\usepackage{parskip}
\usepackage{amsthm}
\usepackage{amsmath}
\usepackage{mathtools}
\usepackage{hyperref}
\usepackage{graphicx}
\usepackage{tabularx}
\usepackage{booktabs}
\hypersetup{colorlinks,citecolor=black,filecolor=black,linkcolor=black,urlcolor=black}
\newtheorem{mydef}{Definition}
\newtheorem{mythm}{Theorem}
\newcommand{\dx}{\mathrm{d}}
\newcommand{\var}{\mathrm{Var}}
\newcommand{\cov}{\mathrm{Cov}}
\newcommand{\corr}{\mathrm{Corr}}
\newcommand{\pr}{\mathrm{Pr}}
\newcommand{\rarrowd}[1]{\xrightarrow{\text{ \textit #1 }}}
\DeclareMathOperator*{\plim}{plim}
\newcommand{\plimn}{\plim_{n \rightarrow \infty}}
\setcounter{secnumdepth}{2}
\author{Zheng Tian}
\date{June 5th, 2017}
\title{Review of Econometrics}
\hypersetup{
 pdfauthor={Zheng Tian},
 pdftitle={Review of Econometrics},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.7)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{The Essence of the OLS Estimation}
\label{sec:orgb88d612}
Multiple regression model involves the models as follows
\begin{equation}
\label{eq:multi-regress-1}
Y_i = \beta_0 + \beta_1 X_{1i} + \beta_2 X_{2i} + \cdots + \beta_k X_{ki} + u_i,\; i = 1, \ldots, n
\end{equation}

Or in matrix notation
\begin{equation}
\label{eq:multi-regress-m}
\mathbf{Y} = \mathbf{X} \boldsymbol{\beta} + \mathbf{u}
\end{equation}

\subsection{The OLS estimation}
\label{sec:org3024f6b}

The OLS estimator is the solution to the minimization problem that
minimizes the sum of squared prediction mistakes (residuals)
\begin{equation}
\label{eq:ols-multi-regress}
\operatorname*{Minimize}_{b_i,i=0,\dotsc,k}\: \sum_{i=1}^n \hat{u}_i^2 = \sum_{i=1}^n (Y_i - b_0 - b_1 X_{1i} - \cdots - b_k X_{ki})^2
\end{equation}

\subsubsection*{When \(k = 2\)}
\label{sec:org709a7b3}
\begin{align}
\hat{\beta}_1 & = \frac{\sum_{i=1}^n (X_i - \bar{X})(Y_i - \bar{Y})}{\sum_{i=1}^n (X_i - \bar{X})^2}  \label{eq:betahat-1} \\
\hat{\beta}_0 & = \bar{Y} - \hat{\beta}_1 \bar{X}  \label{eq:betahat-0}
\end{align}

\subsubsection*{In general}
\label{sec:org91bd64b}
\begin{equation}
\label{eq:betahat-mult}
\boldsymbol{\hat{\beta}} = (\mathbf{X}^{\prime} \mathbf{X})^{-1} \mathbf{X}^{\prime} \mathbf{Y}
\end{equation}

\subsection{Measures of fit}
\label{sec:org4fc6d9c}
\subsubsection*{SER}
\label{sec:org69875e9}
\begin{equation}
\label{eq:ser-m}
SER = s_{\hat{u}},\; \text{ where } s^2_{\hat{u}} = \frac{1}{n-k-1} \sum_{i=1}^n \hat{u}_i^2 =\frac{\mathbf{\hat{u}}^{\prime} \mathbf{\hat{u}}}{n-k-1} = \frac{SSR}{n-k-1}
\end{equation}
\subsubsection*{\(R^2\)}
\label{sec:orgcf26742}
\begin{itemize}
\item The total sum of squares (TSS): \(TSS = \sum_{i=1}^n (Y_i - \bar{Y})^2\)
\item The explained sum of squares (ESS): \(ESS = \sum_{i=1}^n (\hat{Y}_i - \bar{Y})^2\)
\item The sum of squared residuals (SSR): \(SSR = \sum_{i=1}^n
     \hat{u}_i^2\)
\item An important equality is \(TSS = ESS + SSR\), which holds only when we
use the OLS estimation.
\end{itemize}

\begin{equation}
\label{eq:r2-center} 
R^2 = \frac{ESS}{TSS} = 1 - \frac{SSR}{TSS}
\end{equation}

\subsubsection*{The Adjusted \(R^2\)}
\label{sec:orga209b3b}
\begin{equation}
\label{eq:adj-r2}
\bar{R}^2 = 1 - \frac{n-1}{n-k-1}\frac{SSR}{TSS} = 1 - \frac{s^2_u}{s^2_Y}
\end{equation}

\begin{itemize}
\item What is the purpose of designing the adjusted \(R^2\)?

It is to alleviate the problem of \(R^2\) that when a new regressor is
added, as long as its coefficient is not zero, \(R^2\) will always
increase, regardless of whether the new regressor is a determinant
of \(Y\).
\end{itemize}

\subsubsection*{The limitation of \(R^2\) and \(\bar{R}^2\)}
\label{sec:org93d3af2}
\begin{itemize}
\item A high \(R^2\) or \(\bar{R}^2\) does not mean that you have eliminated omitted variable bias.
\item A high \(R^2\) or \(\bar{R}^2\) does not mean that you have an unbiased estimator of a causal effect (\(\beta_1\)).
\item A high \(R^2\) or \(\bar{R}^2\) does not mean that the included
variables are statistically significant. This must be determined
using hypotheses tests.
\end{itemize}

\subsection{The least squares assumptions}
\label{sec:org25f7b7c}
\begin{itemize}
\item Assumption \#1: \(E(u_i | \mathbf{X}_i) = 0\)
\item Assumption \#2: \((Y_i, \mathbf{X}_i^{\prime})\, i=1, \ldots, n\) are i.i.d.
\item Assumption \#3: Large outliers are unlikely, i.e.,, \(0 < E(\mathbf{X}^4) < \infty\) and \(0 < E(\mathbf{Y}^4) < \infty\)
\item Assumption \#4: No perfect multicollinearity
\end{itemize}
\subsection{Sampling distributions of the OLS estimators}
\label{sec:org39c1b8b}
\subsubsection*{Unbiasedness:}
\label{sec:orgae23a4a}
\(E(\hat{\boldsymbol{\beta}}) = \boldsymbol{\beta}\)
\subsubsection*{Consistency:}
\label{sec:org8cd12bd}
\(\plim_{n \rightarrow \infty} \hat{\boldsymbol{\beta}} = \boldsymbol{\beta}\)
\subsubsection*{Efficiency:}
\label{sec:org4f2576c}
The Gauss-Markov theorem ensures that the OLS is the BLUE under the least
squares assumptions plus the homoskedasticity assumption. 
\subsubsection*{The asymptotic normal distribution:}
\label{sec:org6cf3692}
\begin{equation}
\label{eq:normal-bhat-m}
\hat{\boldsymbol{\beta}} \rarrowd{d} N(\boldsymbol{\beta}, \mathbf{\Sigma_{\hat{\boldsymbol{\beta}}}})
\end{equation}
where \(\mathbf{\Sigma_{\hat{\boldsymbol{\beta}}}} =
\var(\hat{\boldsymbol{\beta}} | \mathbf{X})\) for which use
Equation (\ref{eq:varbhat-hm}) for the homoskedastic case and Equation
(\ref{eq:varbhat-ht}) for the heteroskedastic case. 
\begin{align}
\var(\hat{\boldsymbol{\beta}} | \mathbf{X}) &= \sigma^2_u (\mathbf{X}^{\prime} \mathbf{X})^{-1} \label{eq:varbhat-hm} \\
\var_{\mathrm{h}}(\hat{\boldsymbol{\beta}} | \mathbf{X}) &= \left(\mathbf{X}^{\prime} \mathbf{X}\right)^{-1} \mathbf{\Sigma} (\mathbf{X}^{\prime} \mathbf{X})^{-1} \label{eq:varbhat-ht}
\end{align} 

\section{Hypothesis Test Concerning the Coefficients in Multiple Regression Models}
\label{sec:orgcda6518}
\subsection{The t test}
\label{sec:org2c0e38c}
\subsubsection*{A single hypothesis test}
\label{sec:orgd918425}
\begin{itemize}
\item Two sided: \[ H_0:\, \beta_j = \beta_{j,0} \text{ vs. } H_1:\, \beta_j \neq
  \beta_{j,0} \]
\item One sided: \[ H_0:\, \beta_j = \beta_{j,0} \text{ vs. } H_1:\, \beta_j <
  \beta_{j,0} \]
\end{itemize}
\subsubsection*{The t statistics}
\label{sec:org1be51f3}
\[ t = \frac{\hat{\beta}_j - \beta_{j,0}}{SE(\hat{\beta}_j)} \]
where \(SE(\hat{\beta}_j)\) is the \textbf{heteroskedasticity-robust} standard error of \(\hat{\beta}_j\). 

\subsubsection*{The confidence interval}
\label{sec:org2be9693}
\[ \left[\hat{\beta}_j - 1.96 SE(\hat{\beta}_j),\; \hat{\beta}_j +
1.96 SE(\hat{\beta}_j)\right] \]

\subsection{The F test}
\label{sec:org957796b}
\subsubsection*{A joint hypothesis: linear and involving more than one coefficients}
\label{sec:org09e5530}
\begin{equation}
\label{eq:jnt-hypo-1}
H_0: \beta_1 = \beta_{1,0},\ \ldots, \beta_q = \beta_{q,0} \text{ vs. } H_1: \text{at least one restriction does not hold}
\end{equation} 
\begin{equation}
\label{eq:jnt-hyp-2}
H_0:\, \beta_1 = \beta_2 \text{ vs. } H_1:\, \beta_1 \neq \beta_2
\end{equation}
or
\begin{equation}
\label{eq:jnt-hyp-3}
H_0:\, \beta_1 + \beta_2 = 1 \text{ vs. } H_1:\, \beta_1 + \beta_2 \neq 1
\end{equation}
or more generally, 
\begin{equation}
\label{eq:jnt-hyp-4}
H_0: \beta_1 + \beta_2 = 0,\, 2\beta_2 + 4\beta_3 + \beta_4 = 3 \text{ vs. } H_1:\, \text{at least one restriction does not hold}
\end{equation}
\begin{equation}
\label{eq:jnt-hyp-g}
H_0:\, \mathbf{R}\boldsymbol{\beta} = \mathbf{r} \text{ vs. } H_1: \mathbf{R}\boldsymbol{\beta} \neq \mathbf{r}
\end{equation}
