handouts/lecture_notes/finalreview/finalreview_2017.org
*** The F-statistic
\begin{equation}
\label{eq:ftest-gen}
F = \frac{1}{q}(\mathbf{R}\hat{\boldsymbol{\beta}} - \mathbf{r})^{\prime} \left[ \mathbf{R} \widehat{\var(\hat{\boldsymbol{\beta}})} \mathbf{R}^{\prime} \right]^{-1} (\mathbf{R}\hat{\boldsymbol{\beta}} - \mathbf{r})
\end{equation}

- The F distribution: $F \overset{a}{\sim} F(q, \infty)$

- The homoskedasticity-only F statistic
  \begin{equation}
  \label{eq:ftest-hm-r}
  F = \frac{(SSR_{\text{restrict}} - SSR_{\text{unrestrict}})/q}{SSR_{\text{unrestrict}}/(n-k-1)} = \frac{(R^2_{\text{unrestrict}} - R^2_{\text{restrict}})/q}{(1 - R^2_{\text{unrestrict}})/(n-k-1)} \sim F(q, n-k-1)
  \end{equation}

*** The confidence set
A 95% confidence set for two or more coefficients is 
- a set that contains the true population values of these coefficients
  in 95% of randomly drawn samples.
- an ellipse containing the pairs of values of $\beta_1$ and
  $\beta_2$ that cannot be rejected using the F-statistic at the 5%
  significance level
- $\{\beta_1, \beta_2:\, F_{\beta_1,\beta_2} <
  c_F\}$, where $c_F$ is the 5% critical value of the $F(2, \infty)$

* Nonlinear regression models
** A general nonlinear model
A general nonlinear regression model is 
\begin{equation}
\label{eq:nl-general}
Y_i = f(\mathbf{X}_i; \boldsymbol{\theta}) + u_i
\end{equation}

The effect of $Y$ of a change in $X$ can be computed as
\begin{equation}
\label{eq:nl-gen-effect}
\Delta Y = f(X_1 + \Delta X_1, X_2, \ldots, X_k; \boldsymbol{\theta}) - f(X_1, X_2, \ldots, X_k; \boldsymbol{\theta})
\end{equation}

** Polynomials
*** A polynomial regression model of degree r
\begin{equation}
\label{eq:poly-r}
Y_i = \beta_0 + \beta_1 X_i + \beta_2 X_i^2 + \cdots + \beta_r X_i^r + u_i
\end{equation}

*** Testing the null hypothesis that the population regression function is linear
\[ H_0:\, \beta_2 = 0, \beta_3 = 0, ..., \beta_r = 0 \text{ vs. }
H_1:\, \text{ at least one } \beta_j \neq 0, j = 2, \ldots, r \]
- Use F statistic to test this joint hypothesis. The number of
  restriction is $q = r-1$.

** Logarithms
*** Case I: linear-log model
\begin{equation}
\label{eq:linear-log}
Y_i = \beta_0 + \beta_1 \ln(X_i) + u_i, i = 1, \ldots, n
\end{equation}
- a 1% change in $X$ is associated with a change in $Y$ of
  0.01\beta_1.

*** Case II: log-linear model 
\begin{equation}
\label{eq:log-linear}
\ln(Y_i) = \beta_0 + \beta_1 X_i + u_i
\end{equation}
- a one-unit change in $X$ is associated with a $100 \times \beta_1\%$
  change in $Y$

*** Case III: log-log model
 \begin{equation}
 \label{eq:log-log}
 \ln(Y_i) = \beta_0 + \beta_1 \ln(X_i)
 \end{equation}
 - 1% change in $X$ is associated with a \beta_1% change in $Y$
   because

** Interactions between independent variables
*** Interaction between two binary variables
\begin{equation}
\label{eq:interact-dd}
Y_i = \beta_0 + \beta_1 D_{1i} + \beta_2 D_{2i} + \beta_3 (D_{1i} \times D_{2i}) + u_i
\end{equation}

*** Interactions between a continuous and a binary variable
**** Different intercept, same slope.
\begin{equation}
\label{eq:interact-dx-a}
Y_i = \beta_0 + \beta_1 X_i + \beta_2 D_i + u_i
\end{equation}
**** Different intercepts and different slopes.
\begin{equation}
\label{eq:interact-dx-b}
Y_i = \beta_0 + \beta_1 X_i + \beta_2 D_i + \beta_3 (X_i \times D_i) + u_i
\end{equation}
**** Different intercepts and same intercept.
\begin{equation}
\label{eq:interact-dx-c}
Y_i = \beta_0 + \beta_1 X_i + \beta_2 (X_i \times D_i) + u_i
\end{equation}
*** Interactions between two continuous variables
\begin{equation}
\label{eq:interact-xx}
Y_i = \beta_0 + \beta_1 X_{1i} + \beta_2 X_{2i} + \beta_3 (X_{1i} \times X_{2i}) + u_i
\end{equation}

* Assessing regression analysis
** Internal and external validity
*** Internal validity

The statistical inferences about causal effects are valid for the
population being studied.

*** Internal validity consists of two components

- The estimator of the causal effect should be unbiased and
  consistent.
- Hypothesis tests should have the desired significance level (the
  actual rejection rate of the test under the null hypothesis should
  equal its desired significance level), and the confidence intervals
  should have the desired confidence level. 

*** External validity

The statistical inferences can be generalized from the population and
setting studied to other populations and settings, where the
“setting” refers to the legal, policy, and physical environment
and related salient features.

** Threats to external validity
*** Differences in populations
*** Differences in settings

** Threats to internal validity of multiple regression analysis
*** The five main threats
- Omitted variable bias
- Wrong functional form
- Errors-in-variables bias
- Sample selection bias
- Simultaneous causality bias

All of these imply that $E(u_i|X_{1i},…,X_{ki}) \neq 0$ in which case
OLS is biased and inconsistent.  

*** Omitted variable bias
**** The definition of omitted variable bias

Omitted variable bias is the bias in the OLS esitmator that arises
when the included regressors, $\mathbf{X}$, are correlated with
omitted variables, $\mathbf{Z}$. 

**** Solutions to omitted variable bias
- When the omitted variables are observed, include them or control
  variables that are measurable.
- When the omitted variable are not observed
  - Panel data model
  - Instrumental variables method
  - Randomized controlled experiment

*** Misspecification of functional form

We consider functional form misspecification as a type of omitted
variable bias, that is, we omit the appropriate nonlinear terms in the
regression model. 

*** Measurement error and errors-in-variable bias

\begin{equation}
\begin{split}
Y_i &= \beta_0 + \beta_1 \tilde{X}_i + [\beta_1 (X_i - \tilde{X}_i) + u_i] \\
&= \beta_0 + \beta_1 \tilde{X}_i + v_i \label{eq:err-in-var}
\end{split}
\end{equation}

**** The classical measurement error model
\begin{equation}
\label{eq:eiv-class}
\tilde{X}_i = X_i + w_i, \text{ where } \corr(w_i, X_i) = 0 \text{
and } \corr(w_i, u_i) = 0
\end{equation}
It follows that $\corr(w_i, \tilde{X}_i) \neq 0$. 

With the classical measurement error model, the OLS estimator
$\hat{\beta}_1$ of Equation (\ref{eq:err-in-var}) has the probability
limit
\begin{equation}
\label{eq:eiv-lim}
\hat{\beta}_1 \rarrowd{p} \frac{\sigma^2_X}{\sigma^2_X + \sigma^2_w}\beta_1
\end{equation}
$\hat{\beta}_1$ is an inconsistent estimator of $\beta_1$. 

**** COMMENT The best-guess error model
\begin{equation*}
\tilde{X}_i = E(X_i | \Phi_i)
\end{equation*}
It follows that $\cov(w_i, \tilde{X}_i) = E(w_i \tilde{X}_i) = 0$. 

With the best-guess model, the OLS estimator $\hat{\beta}_1$ is
consistent. 

**** Solutions
***** Instrumental variables method
***** Modeling the measurement errors directly, and adjusting the OLS estimation accordingly

*** Missing data and sample selection
**** Missing data at random

Data are missing for purely random reasons. The OLS estimator is
unbiased. 

**** Missing data based on $X$

Data are missing based on $X$ but unrelated with the data generating
process of $Y$. The OLS estimator is unbiased. 

