handouts/lecture_notes/finalreview/finalreview_2017.org
**** Sample selection bias

The sample selection process affect the value of the dependent
variable $Y$ and the regressors $X$. The OLS estimator is biased. 

**** Solutions to sample selection bias 
- Collect the sample in a way that avoids sample. 
- Heckman's two-step method.
- Randomized controlled experiment.
- Construct a model of the sample selection problem and estimate that
  model. 

*** Simultaneous causality

\begin{gather*}
Y_i = \beta_0 + \beta_1 X_i + u_i \\
X_i = \gamma_0 + \gamma_1 Y_i + v_i
\end{gather*}

**** Solutions to simultaneous causality bias

1. Randomized controlled experiment
2. Simultaneous equation estimation
3. Instrumental variables

* COMMENT Regression with panel data
\[ (X_{it}, Y_{it}),\; i = 1, \ldots, n \text{ and } t = 1, \ldots, T
\]
** The advantages of panel data
With panel data we can control for factors that:
- Vary across entities but do not vary over time
- Could cause omitted variable bias if they are omitted
- Are unobserved or unmeasured – and therefore cannot be included in
  the regression using multiple regression

Here’s the key idea: If an omitted variable does not change over time,
then any changes in $Y$ over time cannot be caused by the
omitted variable.
** The entity fixed effects model
*** The fixed effects regression model with different intercepts
\begin{equation}
\label{eq:fe-a}
Y_{it} = \mathbf{X}_{it}^{\prime} \boldsymbol{\beta} + \alpha_i + u_i, i=1,\dotsc,n, t=1,\dots,T
\end{equation}
*** The fixed effects regression model with binary variables
\begin{equation}
\label{eq:fe-b}
Y_{it} = \mathbf{X}_{it}^{\prime} \boldsymbol{\beta} + \beta_0 + \gamma_2 D2_{it} + \gamma_3 D3_{it} + \cdots + \gamma_n Dn_{it} + u_{it}
\end{equation}

- Keep in mind the dummy variable trap problem!

** The entity and time fixed effects model
\begin{equation}
\label{eq:2fe-a}
Y_{it} = \mathbf{X}_{it}^{\prime} \boldsymbol{\beta} + \alpha_i + \lambda_t + u_{it}
\end{equation}
Or, equivalently
\begin{equation}
\label{eq:2fe-b}
\begin{split}
Y_{it} &= \mathbf{X}_{it}^{\prime} \boldsymbol{\beta} + \beta_0 \\
&+ \gamma_2 D2_{it} + \gamma_3 D3_{it} + \cdots + \gamma_n Dn_{it} \\
&+ \delta_2 B2_{it} + \delta_3 B3_{it} + \cdots + \delta_T BT_{it} + u_{it}
\end{split}
\end{equation}

** Estimation
*** The "before and after" estimation
When $T = 2$, we estimate a model with the first difference.
\[ \Delta Y_i = \Delta \mathbf{X}_i \boldsymbol{\beta} + \Delta u_i, i=1,\dotsc,n  \]
where $\Delta Y_i = Y_{i1} - Y_{i0}$, and $\Delta \mathbf{X}_i =
\mathbf{X}_{i1} - \mathbf{X}_{i0}$.

*** The "entity-demeaned" OLS estimation
1. Compute the entity demeaned variables. That is, Let 
   - $\tilde{Y}_{it} = Y_{it} - \frac{1}{T} \sum_{t=1}^T Y_{it} =
     Y_{it} - \bar{Y}_{i\cdot}$
   - $\tilde{X}_{l,it} = X_{l,it} - \frac{1}{T} \sum_{t=1}^T X_{l,it}
     = X_{l,it} - \bar{X}_{l,i\cdot}$
   - and $\tilde{u}_{it} = u_{it} - \frac{1}{T} \sum_{t=1}^T u_{it} =
     u_{it} - u_{i\cdot}$
   for $i = 1, 2, \ldots, n$ and $l = 1, 2, \ldots, k$.
2. Using the OLS method to estimate the entity demeaned regression
   model
   \begin{equation}
   \label{eq:lsdv}
   \tilde{Y}_{it} = \tilde{\mathbf{X}}_{it}^{\prime}
   \boldsymbol{\beta} + \tilde{u}_{it}
   \end{equation}
   where $\tilde{\mathbf{X}}_{it} = (\tilde{X}_{1,it}, \ldots,
   \tilde{X}_{k,it})^{\prime}$. 
   - The number of observations: $nT$.
   - The number of parameters to be estimated: $k$.
   - $\hat{\boldsymbol{\beta}} = (\tilde{\mathbf{X}}^{\prime}
     \tilde{\mathbf{X}})^{-1} \tilde{\mathbf{X}}^{\prime}
     \tilde{\mathbf{Y}}$, where $\tilde{\mathbf{X}}$ is the $nT \times
     k$ matrix of entity-demeaned regressors, and $\tilde{\mathbf{}}$
     is the $nT \times 1$ vector of the dependent variable.

*** The "before and after" estimation and the "entity-demeaned" estimation are equivalent for $T=2$

** The fixed effects regression assumptions
The fixed effects regression assumptions are
1. $u_{it}$ has conditional mean zero: $E(u_{it} | \mathbf{X}_{i1},
   \mathbf{X}_{i2}, \ldots, \mathbf{X}_{iT}, \alpha_i) = 0$.
2. $(\mathbf{X}_{i1}, \mathbf{X}_{i2}, \ldots, \mathbf{X}_{iT},
   u_{i1}, u_{i2}, \ldots, u_{iT}), i = 1, \ldots, n$ are i.i.d. draws
   from their joint distribution.
3. Large outliers are unlikely: $(\mathbf{X}_{it}, u_{it})$ have
   nonzero finite fourth moments.
4. There is no perfect multicollinearity. 

*** Autocorrelation
- $u_{it}$ and $u_{is}$ can be correlated
- Use the clustered standard errors (HAC) for autocorrelation

 


