handouts/lecture_notes/finalreview/finalreview_2017.tex
variable \(Y\) and the regressors \(X\). The OLS estimator is biased. 

\item Solutions to sample selection bias
\label{sec:orgb8d5b28}
\begin{itemize}
\item Collect the sample in a way that avoids sample.
\item Heckman's two-step method.
\item Randomized controlled experiment.
\item Construct a model of the sample selection problem and estimate that
model.
\end{itemize}
\end{itemize}

\subsubsection*{Simultaneous causality}
\label{sec:org17a6710}

\begin{gather*}
Y_i = \beta_0 + \beta_1 X_i + u_i \\
X_i = \gamma_0 + \gamma_1 Y_i + v_i
\end{gather*}

\begin{itemize}
\item Solutions to simultaneous causality bias
\label{sec:orgb76a57c}

\begin{enumerate}
\item Randomized controlled experiment
\item Simultaneous equation estimation
\item Instrumental variables
\end{enumerate}
\end{itemize}
\end{document}